Revit 2027 API
Form.CurveLoopReferencesOnProfile Property
The curve references in certain curve loop, specified by profile index and curve loop index.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ReferenceArray this[
	int profileIndex,
	int curveLoopIndex
] { get; }
Public ReadOnly Property CurveLoopReferencesOnProfile (
	profileIndex As Integer,
	curveLoopIndex As Integer
) As ReferenceArray
	Get
public:
property ReferenceArray^ CurveLoopReferencesOnProfile[int profileIndex, int curveLoopIndex] {
	ReferenceArray^ get (int profileIndex, int curveLoopIndex);
}
member CurveLoopReferencesOnProfile : ReferenceArray with get
Parameters
profileIndex Int32
Index to specify the profile, should be within 0 and (ProfileCount - 1).
curveLoopIndex Int32
Index to specify the curve loop, should be within 0 and (CurveLoopCount - 1).
Property Value
ReferenceArray
See Also
Reference
Form Class
Autodesk.Revit.DB Namespace